---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldOffsetX
source: html/3c573ec2-8a88-d20a-a445-b218d44e15a2.htm
---
# Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldOffsetX Property

The property labeled "Offset X" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".